app/controllers/notifier_controller.rb

  def check
    @knownEpisodes = Episode.all

    a = Mechanize.new { |agent|
      agent.user_agent_alias = 'Mac Safari'
    }

    url = "http://www.crunchyroll.com/attack-on-titan"
    a.get(url) do |page|
      episodes = page.search '.portrait-element'
      listEpisodes = []
      episodes.each do |episode|
        t = episode.text.strip.split("\n").each { |textpart| textpart.strip! }
        title = t[0]
        description = t[-1]
        # puts "Title: #{title} Description: #{description}"
        if title.include? 'Episode'
          listEpisodes.push(title + "|||" + description)
---
SELECT "episodes".* FROM "episodes"
INSERT INTO "episodes" ("created_at", "number", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Mon, 17 Jun 2013 05:38:29 UTC +00:00], ["number", 12], ["title", "5 days from now"], ["updated_at", Mon, 17 Jun 2013 05:38:29 UTC +00:00]]